#資料有先經過Excel 樞紐前處理，之後用pandas復刻
import pandas as pd
case = pd.read_csv(C:\Users\starc\Desktop\111_python class\case_location_year)
case2 = df.drop(["Africa", "Asia", "Europe", "European Union", "High income", "International", "Low income", "Low middle income","North America", "Niue", "North Korea", "Upper middle income", "World"], axis=0)

#計算每年[每月case新增速率]的平均
case2['2020_rate'] = case2[[['2020_1', '2020_2', '2020_3', '2020_4', '2020_5', '2020_6', '2020_7', '2020_8', '2020_9', '2020_10', '2020_11', '2020_12']].sum()/30
case2['2021_rate'] = case2[[['2021_1', '2021_2', '2021_3', '2021_4', '2021_5', '2021_6', '2021_7', '2021_8', '2021_9', '2021_10', '2021_11', '2021_12']].sum()/30
case2['2022_rate'] = case2[[['2022_1', '2022_2', '2022_3', '2022_4', '2022_5', '2022_6', '2022_7', '2022_8', '2022_9', '2022_10', '2022_11', '2022_12']].sum()/30

#ask: 是否要取2020,2021,2022_rate最大值為參考值呢??(x: 犧牲民主程度 y: 疫情最失控時的病例上升速率)

#刪除母資料的index&值
case_rate = case2.drop('2020_1', '2020_2', '2020_3', '2020_4', '2020_5', '2020_6', '2020_7', '2020_8', '2020_9', '2020_10', '2020_11', '2020_12', '2021_1', '2021_2', '2021_3', '2021_4', '2021_5', '2021_6', '2021_7', '2021_8', '2021_9', '2021_10', '2021_11', '2021_12', '2022_1', '2022_2', '2022_3', '2022_4', '2022_5', '2022_6', '2022_7', '2022_8', '2022_9', '2022_10', '2022_11', '2022_12', axis = 1)
case_rate = case_rate.reset_index(drop = True)

#輸出
case_rate.to_csv("caserate_data.csv")

